Tekla.Structures.DirectManipulation.Adapter.Controls.ControlBaseExtensions
The Tekla.Structures.DirectManipulation.Adapter.Controls.ControlBaseExtensions class provides the helper methods for the WPF controls.

Tekla.Structures.DirectManipulation.Adapter.Controls.ControlBaseExtensions.ToVisibility(System.Boolean)
Converts the System.Boolean value into the corresponding System.Windows.Visibility.
isVisible: The System.Boolean value.
Returns: The converted System.Windows.Visibility.

Tekla.Structures.DirectManipulation.Adapter.Controls.ControlBaseExtensions.GetBitmapImage(Tekla.BIM.DirectManipulation.Services.Controls.IControl)
Gets the bitmap image from the control data source.
control: The control.
Returns: The bitmap image.

Tekla.Structures.DirectManipulation.Adapter.Controls.ControlBaseExtensions.SetTitleImage(System.Windows.DependencyObject,Tekla.BIM.DirectManipulation.Services.Controls.IControl)
Sets the title image for the control.
control: The target control.
dataSource: The data source.
Throws System.ArgumentNullException: control

Tekla.Structures.DirectManipulation.Adapter.Controls.ControlBaseExtensions.GetImageContent(Tekla.BIM.DirectManipulation.Services.Controls.IControl)
Gets the content of the image.
control: The control.
Returns: The content of the image.

Tekla.Structures.DirectManipulation.Adapter.Controls.ControlBaseExtensions.SetTitleText(Tekla.BIM.DirectManipulation.Services.Controls.ControlBase)
Sets the title text for the control based on the control tooltip.
control: The target control.
Throws System.ArgumentNullException: control

Tekla.Structures.DirectManipulation.Adapter.Controls.ControlBaseExtensions.SetTitleText(Tekla.BIM.DirectManipulation.Services.Controls.ControlBase,System.String)
Sets the title text for the control.
control: The target control.
text: The title text.
Throws System.ArgumentNullException: control